$(function () {

    var allObject = {
        sideBar: $('.sideBar'),
        modeBtn: $('.mode-btn'),
        sliderSun: $('.slider-sun'),
        sliderMoon: $('.slider-moon'),
        noteBarUl: $('.notes-bar ul')
    };

    var browserServer = {

        localhost: window.localhost,

        // 图片地址
        localhost_user_avatar: window.localhost_user_avatar,

        formDate: null,

        // 获取到的笔记
        notes: null,

        uid: null,

        // 获取当前用户笔记
        getNotes: function () {
            browserServer.uid = window.location.href.split('/')[4];
            let data = {
                requestType: "note",
                operation: "allNote",
                authorUid: browserServer.uid
            }
            console.log(browserServer.uid)
            browserServer.browserServerCore(data);
        },

        // axios 核心代码封装
        browserServerCore: function (data) {
            axios({
                url: browserServer.localhost + 'dispatcherServlet',
                method: 'post',
                headers: {
                    "Content-Type": "application/x-www-form-urlencoded; charset=utf-8"
                },
                data
            }).then(function (response) {
                console.log(response.data)
                browserServer.notes = response.data;
                otherEvent.initialAuthorInfer();
            });
        },
    };

    browserServer.getNotes();


    var module = {

        sunCSS: $('<link id="sunCSS" rel="stylesheet" href="' + browserServer.localhost + 'CSS/notes/sun.css">'),

        nightCSS: $('<link id="nightCSS" rel="stylesheet" href="' + browserServer.localhost + 'CSS/notes/night.css">'),
    }


    var otherEvent = {

        // 初始化作者信息
        initialAuthorInfer: function () {
            $('.img-avatar').css('background-image', 'url(' + browserServer.localhost_user_avatar + browserServer.notes.authorUserAvatar + ')');
            $('.nickname').text(browserServer.notes.authorNickname);
            $('.user-infer').find('a').prop('href', browserServer.localhost + 'homepage/' + browserServer.uid);
            otherEvent.showNotes();
        },

        // 侧栏
        moveInSideBar: function () {
            allObject.sideBar.hover(function () {
                allObject.sideBar.find('.nickname').fadeIn(300);
            }, function () {
                $(this).find('.nickname').hide();
            })
        },


        // 模式切换
        changeMode: function () {
            let flag = false;
            allObject.modeBtn.click(function () {
                if (flag) {
                    $('.moon-self').hide();
                    $('.sun-self').show();
                    $('#nightCSS').remove();
                    $('head').append(module.sunCSS);
                    flag = false;
                } else {
                    $('.moon-self').show();
                    $('.sun-self').hide();
                    $('#sunCSS').remove();
                    $('head').append(module.nightCSS);
                    flag = true;
                }
            });
        },


        // 对获取到的笔记进行相关操作
        showNotes: function () {
            allObject.noteBarUl.empty();
            if (browserServer.notes.noteList.length === 0) {
                $('.empty-notes').show();
            } else {
                browserServer.notes.noteList.forEach(function (item) {
                    let li = $('<li><a href="javascript:;"><div class="note-title"></div><div class="note-abstract"></div><div class="note-infer"><div class="release-time"><svg t="1660742212889" class="icon time-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4089" width="200" height="200"><path d="M827.871087 196.128913C743.498468 111.756293 631.321596 65.290005 512 65.290005c-119.319549 0-231.499491 46.465265-315.871087 130.837884S65.290005 392.680451 65.290005 512s46.465265 231.499491 130.837884 315.871087 196.551538 130.837884 315.871087 130.837884c119.321596 0 231.499491-46.465265 315.871087-130.837884S958.708971 631.319549 958.708971 512 912.243707 280.500509 827.871087 196.128913zM531.556405 917.246651l0-74.145697c0-11.31572-9.174963-20.491707-20.491707-20.491707-11.316743 0-20.491707 9.174963-20.491707 20.491707l0 74.059739C283.276738 906.322857 116.693746 739.164766 106.755396 531.634176l72.351841 0c11.31572 0 20.491707-9.174963 20.491707-20.491707 0-11.31572-9.174963-20.491707-20.491707-20.491707l-72.273047 0c10.769274-206.737528 177.01253-373.005342 383.740848-383.813502l0 72.346725c0 11.316743 9.174963 20.491707 20.491707 20.491707 11.31572 0 20.491707-9.17394 20.491707-20.491707L531.558451 106.752326c207.593012 9.901511 374.807385 176.539762 385.609405 383.89946l-74.142627 0c-11.316743 0-20.491707 9.174963-20.491707 20.491707 0 11.316743 9.174963 20.491707 20.491707 20.491707l74.220399 0C907.275555 739.78796 739.720422 907.317511 531.556405 917.246651zM532.098757 503.118726 532.098757 258.240529c0-11.316743-9.174963-20.491707-20.491707-20.491707-11.31572 0-20.491707 9.17394-20.491707 20.491707l0 254.66612c0 7.858992 4.429893 14.677281 10.924817 18.114566L693.447539 722.42757c4.002151 4.000104 9.245572 6.001691 14.490016 6.001691s10.487865-2.001587 14.490016-6.001691c8.002254-8.002254 8.002254-20.977777 0-28.980032L532.098757 503.118726z" p-id="4090"></path></svg><span class="time"></span></div><div class="view-number"><svg t="1660742304260" class="icon view-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4233" width="200" height="200"><path d="M957.971679 501.685074c-6.928806-9.940396-172.653245-243.818051-441.060321-243.818051-268.409123 0-434.131515 233.877655-441.061344 243.818051-10.730389 15.408945-10.730389 35.877115 0 51.284013 6.928806 9.94142 172.652222 243.819075 441.061344 243.819075 268.407076 0 434.130492-233.877655 441.060321-243.819075C968.701045 537.561166 968.701045 517.092995 957.971679 501.685074zM516.911358 751.877299c-248.028956 0-404.191622-224.550219-404.191622-224.550219s156.161642-224.551242 404.191622-224.551242c248.028956 0 404.190599 224.551242 404.190599 224.551242S764.940314 751.877299 516.911358 751.877299z" p-id="4234"></path><path d="M516.911358 347.687724c-99.206466 0-179.641403 80.434937-179.641403 179.64038s80.434937 179.64038 179.641403 179.64038c99.205443 0 179.639357-80.434937 179.639357-179.64038S616.116801 347.687724 516.911358 347.687724zM516.911358 662.057621c-74.2951 0-134.730541-60.435441-134.730541-134.729517s60.435441-134.730541 134.730541-134.730541c74.294077 0 134.728494 60.435441 134.728494 134.730541S591.205435 662.057621 516.911358 662.057621z" p-id="4235"></path></svg><span class="view"></span></div><div class="mark-number"><svg t="1660742353007" class="icon mark-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4384" width="200" height="200"><path d="M511.999488 847.882863c-28.734592 0-56.729303-2.604314-83.969807-7.099698L231.232673 960.185602 231.232673 761.40735C128.618486 689.355337 62.772174 578.889433 62.772174 454.825836c0-217.07906 201.129864-393.058051 449.228338-393.058051 248.084146 0 449.228338 175.980014 449.228338 393.058051C961.227826 671.917176 760.083635 847.882863 511.999488 847.882863zM511.999488 117.91762c-217.086932 0-393.074156 150.851707-393.074156 336.907193 0 114.166179 66.421434 214.898395 167.761552 275.820929l-1.768346 130.234133 132.171551-79.455633c30.4487 6.497994 62.117231 10.308787 94.910422 10.308787 217.101258 0 393.073132-150.825101 393.073132-336.907193C905.073644 268.769326 729.10177 117.91762 511.999488 117.91762zM736.614169 510.976694c-31.011542 0-56.154182-25.128307-56.154182-56.150858 0-31.010271 25.14264-56.151881 56.154182-56.151881s56.154182 25.14161 56.154182 56.151881C792.768351 485.848387 767.624687 510.976694 736.614169 510.976694zM511.999488 510.976694c-31.010518 0-56.153158-25.128307-56.153158-56.150858 0-31.010271 25.14264-56.151881 56.153158-56.151881 31.011542 0 56.154182 25.14161 56.154182 56.151881C568.15367 485.848387 543.01103 510.976694 511.999488 510.976694zM287.385831 510.976694c-31.010518 0-56.153158-25.128307-56.153158-56.150858 0-31.010271 25.14264-56.151881 56.153158-56.151881s56.153158 25.14161 56.153158 56.151881C343.53899 485.848387 318.39635 510.976694 287.385831 510.976694z" p-id="4385"></path></svg><span class="mark"></span></div><div class="like-number"><svg t="1660742442085" class="icon like-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4528" width="200" height="200"><path d="M510.340709 900.892171c-23.173792 0-247.254314-180.180685-332.157006-289.301965-58.338686-53.264111-105.562221-152.650679-105.562221-222.732827 0-148.765185 108.952434-269.77626 242.874563-269.77626 81.781608 0 151.191444 67.679425 194.013739 137.605008 42.822294-69.925582 112.207571-137.605008 194.013739-137.605008 133.922129 0 242.874563 121.011074 242.874563 269.77626 0 70.239737-47.445592 169.805384-106.055454 223.182059C754.630505 722.553437 534.862195 900.892171 510.340709 900.892171zM315.497069 165.0685c-108.570741 0-196.887182 100.397594-196.887182 223.788879 0 58.382689 42.059931 145.353482 91.864244 189.903118 1.033539 0.943488 2.022053 1.977028 2.874467 3.098571 83.937714 109.042485 251.138784 234.421031 297.17119 267.923052 48.054459-34.715663 213.05542-161.193239 294.611901-267.451308 0.899486-1.12359 1.888-2.178619 2.964518-3.142573 50.03251-44.663222 92.312452-131.813095 92.312452-190.33086 0-123.391285-88.316441-223.788879-196.885136-223.788879-70.487378 0-137.808646 75.135234-173.241646 149.597133-7.634888 16.033162-33.908274 16.033162-41.543162 0C453.303668 240.203734 385.983423 165.0685 315.497069 165.0685z" p-id="4529"></path></svg><span class="like"></span></div></div></a></li>');
                    li.find('.note-title').text(item.noteTitle);
                    li.find('.note-abstract').text('摘要: ' + item.noteAbstract);
                    li.find('.time').text('发表于 ' + item.buildDate.split('.')[0]);
                    li.find('.view').text('阅读: ' + item.viewNumber);
                    li.find('.mark').text('评论: ' + item.markNumber);
                    li.find('.like').text('获赞数: ' + item.likeNumber);
                    li.find('a').prop('href', browserServer.localhost + browserServer.uid + '/notes/note?note_id=' + item.noteId);
                    allObject.noteBarUl.append(li);
                });
            }
        },

    };
    otherEvent.moveInSideBar();
    otherEvent.changeMode();


});